Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70b/atdf/ATSAME70J21B.atdf
    <module name="EFC" caption="Embedded Flash Controller" id="6450" version="X">
      <register-group name="EFC">
        <register caption="EEFC Flash Mode Register" name="EEFC_FMR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Flash Ready Interrupt Enable" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Wait State" mask="0x00000F00" name="FWS"/>
          <bitfield caption="Sequential Code Optimization Disable" mask="0x00010000" name="SCOD"/>
          <bitfield caption="Code Loop Optimization Enable" mask="0x04000000" name="CLOE"/>
        </register>
        <register caption="EEFC Flash Command Register" name="EEFC_FCR" offset="0x04" rw="W" size="4">
          <bitfield caption="Flash Command" mask="0x000000FF" name="FCMD" values="EEFC_FCR__FCMD"/>
          <bitfield caption="Flash Command Argument" mask="0x00FFFF00" name="FARG"/>
          <bitfield caption="Flash Writing Protection Key" mask="0xFF000000" name="FKEY" values="EEFC_FCR__FKEY"/>
        </register>
        <register caption="EEFC Flash Status Register" name="EEFC_FSR" offset="0x08" rw="R" size="4">
          <bitfield caption="Flash Ready Status (cleared when Flash is busy)" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Command Error Status (cleared on read or by writing EEFC_FCR)" mask="0x00000002" name="FCMDE"/>
          <bitfield caption="Flash Lock Error Status (cleared on read)" mask="0x00000004" name="FLOCKE"/>
          <bitfield caption="Flash Error Status (cleared when a programming operation starts)" mask="0x00000008" name="FLERR"/>
          <bitfield caption="Unique ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read)" mask="0x00010000" name="UECCELSB"/>
          <bitfield caption="Multiple ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read)" mask="0x00020000" name="MECCELSB"/>
          <bitfield caption="Unique ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read)" mask="0x00040000" name="UECCEMSB"/>
          <bitfield caption="Multiple ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read)" mask="0x00080000" name="MECCEMSB"/>
        </register>
        <register caption="EEFC Flash Result Register" name="EEFC_FRR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Flash Result Value" mask="0xFFFFFFFF" name="FVALUE"/>
        </register>
        <register caption="Write Protection Mode Register" name="EEFC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="EEFC_WPMR__WPKEY"/>
        </register>
      </register-group>
      <value-group caption="" name="EEFC_FCR__FCMD">
        <value caption="Get Flash descriptor" name="GETD" value="0x00"/>
        <value caption="Write page" name="WP" value="0x01"/>
        <value caption="Write page and lock" name="WPL" value="0x02"/>
        <value caption="Erase page and write page" name="EWP" value="0x03"/>
        <value caption="Erase page and write page then lock" name="EWPL" value="0x04"/>
        <value caption="Erase all" name="EA" value="0x05"/>
        <value caption="Erase pages" name="EPA" value="0x07"/>
        <value caption="Set lock bit" name="SLB" value="0x08"/>
        <value caption="Clear lock bit" name="CLB" value="0x09"/>
        <value caption="Get lock bit" name="GLB" value="0x0A"/>
        <value caption="Set GPNVM bit" name="SGPB" value="0x0B"/>
        <value caption="Clear GPNVM bit" name="CGPB" value="0x0C"/>
        <value caption="Get GPNVM bit" name="GGPB" value="0x0D"/>
        <value caption="Start read unique identifier" name="STUI" value="0x0E"/>
        <value caption="Stop read unique identifier" name="SPUI" value="0x0F"/>
        <value caption="Get CALIB bit" name="GCALB" value="0x10"/>
        <value caption="Erase sector" name="ES" value="0x11"/>
        <value caption="Write user signature" name="WUS" value="0x12"/>
        <value caption="Erase user signature" name="EUS" value="0x13"/>
        <value caption="Start read user signature" name="STUS" value="0x14"/>
        <value caption="Stop read user signature" name="SPUS" value="0x15"/>
      </value-group>
      <value-group caption="" name="EEFC_FCR__FKEY">
        <value caption="The 0x5A value enables the command defined by the bits of the register. If the field is written with a different value, the write is not performed and no action is started." name="PASSWD" value="0x5A"/>
      </value-group>
      <value-group caption="" name="EEFC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0x454643"/>
      </value-group>
    </module>
    <module name="GMAC" caption="Gigabit Ethernet MAC" id="11046" version="S">
      <register-group name="GMAC_SA" size="8">
        <register caption="Specific Address 1 Bottom Register" name="GMAC_SAB" offset="0x00" rw="RW" size="4">
          <bitfield caption="Specific Address 1" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Specific Address 1 Top Register" name="GMAC_SAT" offset="0x04" rw="RW" size="4">
          <bitfield caption="Specific Address 1" mask="0x0000FFFF" name="ADDR"/>
        </register>
      </register-group>
      <register-group name="GMAC">
        <register caption="Network Control Register" name="GMAC_NCR" offset="0x000" rw="RW" size="4">
          <bitfield caption="Loop Back Local" mask="0x00000002" name="LBL"/>
          <bitfield caption="Receive Enable" mask="0x00000004" name="RXEN"/>
          <bitfield caption="Transmit Enable" mask="0x00000008" name="TXEN"/>
          <bitfield caption="Management Port Enable" mask="0x00000010" name="MPE"/>
          <bitfield caption="Clear Statistics Registers" mask="0x00000020" name="CLRSTAT"/>
          <bitfield caption="Increment Statistics Registers" mask="0x00000040" name="INCSTAT"/>
          <bitfield caption="Write Enable for Statistics Registers" mask="0x00000080" name="WESTAT"/>
          <bitfield caption="Back pressure" mask="0x00000100" name="BP"/>
          <bitfield caption="Start Transmission" mask="0x00000200" name="TSTART"/>
          <bitfield caption="Transmit Halt" mask="0x00000400" name="THALT"/>
          <bitfield caption="Transmit Pause Frame" mask="0x00000800" name="TXPF"/>
          <bitfield caption="Transmit Zero Quantum Pause Frame" mask="0x00001000" name="TXZQPF"/>
          <bitfield caption="Store Receive Time Stamp to Memory" mask="0x00008000" name="SRTSM"/>
          <bitfield caption="Enable PFC Priority-based Pause Reception" mask="0x00010000" name="ENPBPR"/>
          <bitfield caption="Transmit PFC Priority-based Pause Frame" mask="0x00020000" name="TXPBPF"/>
          <bitfield caption="Flush Next Packet" mask="0x00040000" name="FNP"/>
        </register>
        <register caption="Network Configuration Register" name="GMAC_NCFGR" offset="0x004" rw="RW" size="4">
          <bitfield caption="Speed" mask="0x00000001" name="SPD"/>
          <bitfield caption="Full Duplex" mask="0x00000002" name="FD"/>
          <bitfield caption="Discard Non-VLAN FRAMES" mask="0x00000004" name="DNVLAN"/>
          <bitfield caption="Jumbo Frame Size" mask="0x00000008" name="JFRAME"/>
          <bitfield caption="Copy All Frames" mask="0x00000010" name="CAF"/>
          <bitfield caption="No Broadcast" mask="0x00000020" name="NBC"/>
          <bitfield caption="Multicast Hash Enable" mask="0x00000040" name="MTIHEN"/>
          <bitfield caption="Unicast Hash Enable" mask="0x00000080" name="UNIHEN"/>
          <bitfield caption="1536 Maximum Frame Size" mask="0x00000100" name="MAXFS"/>
          <bitfield caption="Retry Test" mask="0x00001000" name="RTY"/>
          <bitfield caption="Pause Enable" mask="0x00002000" name="PEN"/>
          <bitfield caption="Receive Buffer Offset" mask="0x0000C000" name="RXBUFO"/>
          <bitfield caption="Length Field Error Frame Discard" mask="0x00010000" name="LFERD"/>
          <bitfield caption="Remove FCS" mask="0x00020000" name="RFCS"/>
          <bitfield caption="MDC CLock Division" mask="0x001C0000" name="CLK" values="GMAC_NCFGR__CLK"/>
          <bitfield caption="Data Bus Width" mask="0x00600000" name="DBW"/>
          <bitfield caption="Disable Copy of Pause Frames" mask="0x00800000" name="DCPF"/>
          <bitfield caption="Receive Checksum Offload Enable" mask="0x01000000" name="RXCOEN"/>
          <bitfield caption="Enable Frames Received in Half Duplex" mask="0x02000000" name="EFRHD"/>
          <bitfield caption="Ignore RX FCS" mask="0x04000000" name="IRXFCS"/>
          <bitfield caption="IP Stretch Enable" mask="0x10000000" name="IPGSEN"/>
          <bitfield caption="Receive Bad Preamble" mask="0x20000000" name="RXBP"/>
          <bitfield caption="Ignore IPG GRXER" mask="0x40000000" name="IRXER"/>
        </register>
        <register caption="Network Status Register" name="GMAC_NSR" offset="0x008" rw="R" size="4">
          <bitfield caption="MDIO Input Status" mask="0x00000002" name="MDIO"/>
          <bitfield caption="PHY Management Logic Idle" mask="0x00000004" name="IDLE"/>
        </register>
        <register caption="User Register" name="GMAC_UR" offset="0x00C" rw="RW" size="4">
          <bitfield caption="Reduced MII Mode" mask="0x00000001" name="RMII"/>
        </register>
        <register caption="DMA Configuration Register" name="GMAC_DCFGR" offset="0x010" rw="RW" size="4">
          <bitfield caption="Fixed Burst Length for DMA Data Operations:" mask="0x0000001F" name="FBLDO" values="GMAC_DCFGR__FBLDO"/>
          <bitfield caption="Endian Swap Mode Enable for Management Descriptor Accesses" mask="0x00000040" name="ESMA"/>
          <bitfield caption="Endian Swap Mode Enable for Packet Data Accesses" mask="0x00000080" name="ESPA"/>
          <bitfield caption="Receiver Packet Buffer Memory Size Select" mask="0x00000300" name="RXBMS" values="GMAC_DCFGR__RXBMS"/>
          <bitfield caption="Transmitter Packet Buffer Memory Size Select" mask="0x00000400" name="TXPBMS"/>
          <bitfield caption="Transmitter Checksum Generation Offload Enable" mask="0x00000800" name="TXCOEN"/>
          <bitfield caption="DMA Receive Buffer Size" mask="0x00FF0000" name="DRBS"/>
          <bitfield caption="DMA Discard Receive Packets" mask="0x01000000" name="DDRP"/>
        </register>
        <register caption="Transmit Status Register" name="GMAC_TSR" offset="0x014" rw="RW" size="4">
          <bitfield caption="Used Bit Read" mask="0x00000001" name="UBR"/>
          <bitfield caption="Collision Occurred" mask="0x00000002" name="COL"/>
          <bitfield caption="Retry Limit Exceeded" mask="0x00000004" name="RLE"/>
          <bitfield caption="Transmit Go" mask="0x00000008" name="TXGO"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000010" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000020" name="TXCOMP"/>
          <bitfield caption="HRESP Not OK" mask="0x00000100" name="HRESP"/>
        </register>
        <register caption="Receive Buffer Queue Base Address Register" name="GMAC_RBQB" offset="0x018" rw="RW" size="4">
          <bitfield caption="Receive Buffer Queue Base Address" mask="0xFFFFFFFC" name="ADDR"/>
        </register>
